In [1]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [4]:
titles = pd.read_csv('data/titles.csv', index_col=None)
titles.head()

                title  year
0            Gigantic  2018
1  Lawson: White Heat  2009
2  The Purge: Anarchy  2014
3            Sawar Re  2008
4             Mockery  1927

In [6]:
cast = pd.read_csv('data/cast.csv', index_col=None)
cast.head()

                    title  year     name   type                character     n
0         Suuri illusioni  1985   Homo $  actor                   Guests  22.0
1     Battle of the Sexes  2017  $hutter  actor          Bobby Riggs Fan  10.0
2    Secret in Their Eyes  2015  $hutter  actor          2002 Dodger Fan   NaN
3              Steve Jobs  2015  $hutter  actor  1988 Opera House Patron   NaN
4  Straight Outta Compton  2015  $hutter  actor              Club Patron   NaN

### How many movies are listed in the titles dataframe?

In [7]:
len(titles)

229680

### What are the earliest two films listed in the titles dataframe?

In [8]:
titles.sort_values('year').head(2)

                     title  year
19922           Miss Jerry  1894
169707  The Startled Lover  1898

In [9]:
titles.sort_values('year').tail(2)

                            title  year
79381                    Garriage  2023
28243  The Snowman and the Falcon  2024

### How many movies have the title "Hamlet"?

In [18]:
mtitles = titles['title'].values
count = 0
for title in mtitles:
    if title == "Hamlet":
        count += 1
print(count)

19

In [19]:
len(titles[titles.title == "Hamlet"])

19

### How many movies are titled "North by Northwest"?

In [20]:
len(titles[titles.title == "North by Northwest"])

1

In [19]:
titles[titles.title == "Hamlet"].groupby(titles.year//10).count()

      title  year
year
191       3     3
192       1     1
194       1     1
195       1     1
196       2     2
197       2     2
198       1     1
199       2     2
200       2     2
201       4     4

### When was the first movie titled "Hamlet" made?

In [23]:
Hamlet = titles[titles.title == "Hamlet"]
Hamlet.sort_values('year').head()

         title  year
207119  Hamlet  1910
112063  Hamlet  1911
75010   Hamlet  1913
84989   Hamlet  1921
208678  Hamlet  1948

### List all of the "Treasure Island" movies from earliest to most recent.

In [25]:
Treasure_Island = titles[titles.title == "Treasure Island"].sort_values('year')
Treasure_Island

                  title  year
121190  Treasure Island  1918
135426  Treasure Island  1920
37961   Treasure Island  1934
147828  Treasure Island  1950
157427  Treasure Island  1972
226683  Treasure Island  1973
46832   Treasure Island  1985
2317    Treasure Island  1999

### How many movies were made in the year 1950?

In [26]:
len(titles[titles.year == 1950])

1081

### How many movies were made in the year 1960?

In [27]:
len(titles[titles.year == 1960])

1489

### How many movies were made from 1950 through 1959?

In [28]:
count = 0
for year in range(1950, 1960):
    count += len(titles[titles.year == year])
print(count)

12601

In [29]:
len(titles[(titles.year >= 1950) & (titles.year <= 1959)])

12601

### In what years has a movie titled "Batman" been released?

In [30]:
titles[titles.title == "Batman"].year

192424    1943
209737    1989
Name: year, dtype: int64

In [31]:
titles[titles.title == "Batman"]

         title  year
192424  Batman  1943
209737  Batman  1989

### How many roles were there in the movie "Inception"?

In [32]:
cast.head()

                    title  year     name   type                character     n
0         Suuri illusioni  1985   Homo $  actor                   Guests  22.0
1     Battle of the Sexes  2017  $hutter  actor          Bobby Riggs Fan  10.0
2    Secret in Their Eyes  2015  $hutter  actor          2002 Dodger Fan   NaN
3              Steve Jobs  2015  $hutter  actor  1988 Opera House Patron   NaN
4  Straight Outta Compton  2015  $hutter  actor              Club Patron   NaN

In [34]:
len(cast[cast.title == "Inception"])

77

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [36]:
len(cast[cast.title == "Inception"].n.isnull())

77

In [40]:
c = cast[cast.title == "Inception"]
c = c[c.n.isnull()]
c.head()

            title  year                  name   type         character   n
92632   Inception  2010  Michael (III) August  actor     LAX Passenger NaN
187052  Inception  2010              Ken Bhan  actor  Mombasan Gambler NaN
355473  Inception  2010         John Ceallach  actor     LAX Passenger NaN
649825  Inception  2010         Seve Esposito  actor   Italian Gambler NaN
656057  Inception  2010   Marcus (II) Everett  actor      Stock Broker NaN

### But how many roles in the movie "Inception" did receive an "n" value?

In [42]:
c = cast[cast.title == "Inception"]
c = c[c.n.isnull()]
c.head()
len(c)

26

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [43]:
cast[cast.title == "North by Northwest"].head()

,title,year,name,type,character,n
11943,North by Northwest,1959,Stanley Adams,actor,Lieutenant Harding,NaN
27335,North by Northwest,1959,Andy Albin,actor,Farmer,NaN
53048,North by Northwest,1959,Don Anderson,actor,Worker,NaN
53261,North by Northwest,1959,Ernest Anderson,actor,Porter on Twentieth Century Ltd.,NaN
90531,North by Northwest,1959,Malcolm Atterbury,actor,Man at Prairie Crossing,NaN

In [48]:
ca = cast[cast.title == "North by Northwest"].sort_values('n')
ca = ca[ca.n.notnull()]
ca.head()

,title,year,name,type,character,n
827711,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3308882,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1383389,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
2976957,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
338312,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [49]:
cast[(cast.year == 1972) & (cast.title == "Sleuth")].sort_values('n')

,title,year,name,type,character,n
1619474,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
309696,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
354738,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1391194,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2579049,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1375438,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [55]:
ca = cast[(cast.year == 2007) & (cast.title == "Sleuth")].sort_values('n')
ca = ca[ca.n.notnull()]
ca

          title  year           name   type    character    n
309697   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1227880  Sleuth  2007       Jude Law  actor         Milo  2.0
1714832  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [58]:
len(cast[(cast.title == "Hamlet") & (cast.year == 1921)])

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [59]:
len(cast[(cast.title == "Hamlet") & (cast.year == 1996)])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [60]:
cast[(cast.character == "Hamlet")].head()

                      title  year                 name   type character     n
5881                  Sugar  2008         Hamlet Abreu  actor    Hamlet  58.0
92328       Top of the Town  1937          Mischa Auer  actor    Hamlet   6.0
117978  The Sound of Spying  2014        Jonathan Ball  actor    Hamlet   NaN
151809     Suivez cet avion  1989    Fran?ois Beaulieu  actor    Hamlet  26.0
159274          Hamlet (II)  2007  William Belchambers  actor    Hamlet   NaN

In [61]:
len(cast[(cast.character == "Hamlet")])

89

### How many people have played an "Ophelia"?

In [62]:
len(cast[(cast.character == "Ophelia")])

106

### How many people have played a role called "The Dude"?

In [63]:
len(cast[(cast.character == "The Dude")])

17

### How many people have played a role called "The Stranger"?

In [64]:
len(cast[(cast.character == "The Stranger")])

208

### How many roles has Sidney Poitier played throughout his career?

In [65]:
len(cast[(cast.name == "Sidney Poitier")])

43

### How many roles has Judi Dench played?

In [66]:
len(cast[(cast.name == "Judi Dench")])

54

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [67]:
cast[(cast.name == "Cary Grant") & (cast.year // 10 == 194) & (cast.n == 2)].sort_values('year')

                   title  year        name   type    character    n
827708  My Favorite Wife  1940  Cary Grant  actor         Nick  2.0
827718    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [68]:
cast[(cast.name == "Cary Grant") & (cast.year // 10 == 194) & (cast.n == 1)].sort_values('year')

,title,year,name,type,character,n
827733,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
827690,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
827735,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
827723,Suspicion,1941,Cary Grant,actor,Johnnie,1.0
827737,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
827714,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
827681,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
827706,Mr. Lucky,1943,Cary Grant,actor,Joe Adams,1.0
827707,Mr. Lucky,1943,Cary Grant,actor,Joe Bascopolous,1.0
827715,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
827673,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
827710,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
827709,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
827712,Notorious,1946,Cary Grant,actor,Devlin,1.0
827729,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
827730,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
827705,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
827685,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
827694,I Was a Male War Bride,1949,Cary Grant,actor,Capt. Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [70]:
len(cast[(cast.year // 10 == 195) & (cast.type == "actor")])

153843

### How many roles were avilable for actresses in the 1950s?

In [71]:
len(cast[(cast.year // 10 == 195) & (cast.type == "actress")])

55965

In [21]:
cast[(cast.year // 10 == 195) & (cast.n == 1.0)].sort_values('year')

,title,year,name,type,character,n
3552171,Valentina,1950,Olga Zubarry,actress,Valentina Gonz?lez Garc?a,1.0
2732545,Die Frau von gestern Nacht,1950,Heli Finkenzeller,actress,Heidi,1.0
660722,State Secret,1950,Douglas Fairbanks Jr.,actor,Dr. John Marlowe,1.0
658942,Vita da cani,1950,Aldo Fabrizi,actor,Nino Martoni,1.0
658931,Prima comunione,1950,Aldo Fabrizi,actor,Carlo Carloni,1.0
...,...,...,...,...,...,...
710347,The Gazebo,1959,Glenn Ford,actor,Elliott Nash,1.0
711815,Beast from Haunted Cave,1959,Michael Forest,actor,Gil Jackson,1.0
715195,Abbas yolcu,1959,Renan Fosforoglu,actor,Necdet,1.0
2636421,Daigaku no oneechan,1959,Reiko Dan,actress,Toshiko Sonoe,1.0
1594,Bir qalanin sirri,1959,Gyunduz Abbasov,actor,Elsan,1.0

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [72]:
len(cast[(cast.year <= 1980) & (cast.n == 1.0)])

63520

### How many non-leading roles were available through from the beginning of film history through 1980?

In [73]:
len(cast[(cast.year <= 1980) & (cast.n != 1.0)])

1086995

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [76]:
len(cast[(cast.year <= 1980) & (cast.n.isnull())])

434473